tap "bufbuild/buf"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jeffreywildman/virt-manager"
tap "null-dev/firefox-profile-switcher"
tap "permutive/tap", "git@github.com:permutive/homebrew-tap.git"
tap "teamookla/speedtest"
tap "zackelia/formulae"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Fast linters runner for Go
brew "golangci-lint"
# OpenType text shaping engine
brew "harfbuzz"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Next-gen compiler infrastructure
brew "llvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Additional completion definitions for zsh
brew "zsh-completions"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
brew "permutive/tap/globby"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Web browser
cask "firefox@developer-edition"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# Replacement for Docker Desktop
cask "orbstack"
# System monitor for the menu bar
cask "stats"
vscode "anysphere.cursorpyright"
vscode "ashishalex.dataform-lsp-vscode"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "ziyasal.vscode-open-in-github"
